Австралия/src/Catalogs/SuppliersProducts/SuppliersProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SuppliersProducts</name>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </attributes>
  <attributes>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </attributes>
  <attributes>
    <name>SKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProductsType</name>
    <type>
      <types>EnumRef.ProductsTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/SuppliersProducts/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Function CounterpartyUsesProductCrossReferences(Counterparty) Export 
	
	IsUseProductCrossReferences = Constants.UseProductCrossReferences.Get();
	
	If Not IsUseProductCrossReferences Then
		Return False;
	EndIf;
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED TOP 1
	|	SuppliersProducts.Ref AS Ref
	|FROM
	|	Catalog.SuppliersProducts AS SuppliersProducts
	|WHERE
	|	SuppliersProducts.Owner = &Counterparty";
	
	Query.SetParameter("Counterparty", Counterparty);
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

Procedure FindCrossReferenceByParameters(StructureData) Export 
	
	StructureData.Insert("CrossReference", Catalogs.SuppliersProducts.EmptyRef());
	
	If Not StructureData.Property("Characteristic") Then
		StructureData.Insert("Characteristic", Catalogs.ProductsCharacteristics.EmptyRef());
	EndIf;
	
	StructureDefaultCrossReference = Common.ObjectAttributesValues(StructureData.Products, "ProductCrossReference, Vendor");
	
	DefaultCrossReference = StructureDefaultCrossReference.ProductCrossReference;
	
	If ValueIsFilled(DefaultCrossReference)
		And (Not StructureData.Property("Counterparty")
			Or StructureData.Counterparty = StructureDefaultCrossReference.Vendor) Then
		
		StructureData.Insert("CrossReference", DefaultCrossReference);
		
	ElsIf StructureData.Property("Counterparty") Then
			
		Query = New Query;
		Query.Text = 
		"SELECT ALLOWED
		|	SuppliersProducts.Ref AS Ref
		|FROM
		|	Catalog.SuppliersProducts AS SuppliersProducts
		|WHERE
		|	SuppliersProducts.Owner = &Counterparty
		|	AND SuppliersProducts.Products = &Products
		|	AND SuppliersProducts.Characteristic = &Characteristic
		|	AND NOT SuppliersProducts.DeletionMark";
		
		Query.SetParameter("Counterparty", StructureData.Counterparty);
		Query.SetParameter("Products", StructureData.Products);
		Query.SetParameter("Characteristic", StructureData.Characteristic);
		
		SuppliersProducts = Query.Execute().Unload();
		If SuppliersProducts.Count() = 1 Then
			StructureData.Insert("CrossReference", SuppliersProducts[0].Ref);
		EndIf;
		
	EndIf;
	
EndProcedure

#Region CloneProductRelatedData

Procedure MakeRelatedProductCrossreferences(ProductReceiver, ProductSource) Export
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	SuppliersProducts.Ref AS SupplierProduct,
		|	SuppliersProducts.Products AS Products
		|FROM
		|	Catalog.SuppliersProducts AS SuppliersProducts
		|WHERE
		|	SuppliersProducts.Products = &ProductSource";
	
	Query.SetParameter("ProductSource", ProductSource);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		SupplierProductReceiver = SelectionDetailRecords.SupplierProduct.Copy();
		SupplierProductReceiver.Products = ProductReceiver;
		SupplierProductReceiver.Write();
	EndDo;
	
EndProcedure

#EndRegion

#EndRegion

#Region EventHandlers

Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	NativeLanguagesSupportServer.ChoiceDataGetProcessing(
		ChoiceData,
		Parameters,
		StandardProcessing,
		Metadata.Catalogs.SuppliersProducts);
	
EndProcedure

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	StandardProcessing = False;
	
	Fields.Add("SKU");
	Fields.Add("Description");
	
	NationalLanguageSupportClientServer.PresentationFieldsGetProcessing(Fields, StandardProcessing);
	
EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	StandardProcessing = False;
	Presentation = Data.SKU + " " + Data.Description;
	
	NationalLanguageSupportClientServer.PresentationGetProcessing(Data, Presentation, StandardProcessing);
	
EndProcedure

#EndRegion

#Region Internal

#Region ObjectAttributesLock

// StandardSubsystems.ObjectAttributesLock

// See ObjectsAttributesEditBlockedOverridable.OnDefineObjectsWithLockedAttributes. 
Function GetObjectAttributesToLock() Export
	
	AttributesToLock = New Array;
	AttributesToLock.Add("Products");
	AttributesToLock.Add("Characteristic");
	AttributesToLock.Add("SKU");
	AttributesToLock.Add("Owner");
	
	Return AttributesToLock;
	
EndFunction

// End StandardSubsystems.ObjectAttributesLock

#EndRegion

#EndRegion

#EndIf
